posts/vasconcelos2008.org
#+TITLE: Notes: Space cost analysis using sized types
#+AUTHOR: Hector Suzanne
#+date:<2020-04-06 Mon>
* Introduction
** Programmation embarquée
On veut pouvoir utiliser des langages de haut niveaux dans les systèmes
embarqués pour des raison évidentes de productivité par rapport à C ou
l'assembleur. Mais cela vient avec une perte de prédictabilité quand à la
correction et la consommation de ressources des programmes. Les tests et le
profilage ne suffisent pas à /garantir/ le bon comportement des programmes de
haut niveaux dans les contextes embarqués: on y cherche des
performances prévisible et garanties plutôt meilleures à tout prix.

On distingue programmation /embarquée/, dans laquelle le programme doit jouer avec
des ressources limités génériques, et la programmation /en temps réel/, dans laquelle le
temps de réponse est la quantité bornée. Dans les systèmes embarqués
traditionnels, on garantie la terminaison et la correction en excluant les
constructions syntaxique les plus dangereuses (la récursion, l'allocation
dynamique, les boucles sans bornes sup triviales...). Mais le développement de
la programmation de haut niveau (java, python) sur micro-controlleurs et la
complexification des besoins en embarqué (IOT, exécution par un tierce partie)
ont créés de nouveaux besoins. (cf Stankovic 1988)
** Langages fonctionnels
Les langages fonctionnels permettent de garantir statiquement de bons invariants
/logiques/ de programmes, mais pas de bons invariants /de ressources/. Pourquoi:
- fonctions d'ordre supérieur :: Le flux de contrôle du programme est dynamique,
  et donc plus dur à évaluer. En C, le graphe de flux de contrôle est genérable
  statiquement.
- Copy-on-write data structures :: Même dans les cas simple d'un pipeline de
  transformation, on a pas d'assurance que l'implémentation va générer un
  programme travaillant en-place sur les structures déjà allouées.
- le ramasse-miette :: peut échouer à libérer la mémoire non-accessible dès
  qu'elle peut l'être, voir peut échouer à la libérer tout court. Ils
  obscurcissent la gestion mémoire.
- sémantiques non-strictes :: le coût d'un calcul ne dépend pas que de ça
  définition, mais aussi du contexte d'évaluation. Par exemple:
  =let null = fun [] -> true | _::_ -> false= n'a pas besoin d'évaluer
  entièrement son argument. Il est plus complexe de prendre en compte ces
  interaction appelant-appelé. Aussi, les thunks peuvent maintenir en vie des
  ressources, et donc peuvent causer des fuites mémoires.
- Optimisations :: On veut garantir les consommation du programme à l'exécution
  à partir du code source. Entre les deux se tient un compilateur-optimisateur,
  que l'on doit prendre en compte. Il faut adapter les passes d'optimisations.
** Contribution
On cherche à étendre l'application des langages fonctionnels à la programmation
critique et embarquée en créant une analyse automatique des consommations en
temps et mémoire des langages fonctionnels. Il s'agit d'une analyse statique
modulaire dirigée par les types pour prédire les bornes sup des consommations
mémoire. Les bornes sont exprimés par des compositions de fonctions familières
à croissance connues, en fonction non pas des valeurs des arguments, mais à partir
de grandeurs abstraites pertinentes extraites de leurs type.

On introduit un langage sur lequel porte l'analyse: /Hume/. Il est fonctionnel
strict, avec types et fonctions récursives, mais son cœur est d'ordre 1
uniquement. Il vient avec une machine abstraite à région mémoires et
ramasse-miette sans copie qui sert de modèle de coût pour ce langage. Cette
machine est basée sur SECD et est étendue pour supporter des optimisations
mémoires tractables pour l'analyse. Contrairement aux travaux précédents, on
supporte les types et tailles définis par l'utilisateur.

Notre contribution est limité de la manière suivante:
- On se restreint à /Hume core/, une simplification de Hume de premier ordre.
  Certaine constructions de Hume sont néanmoins admissibles dans Hume core.
- On impose des contraintes linéaires entre les coût/les tailles. Cela permet de
  garantir une analyse automatique par des technique d'interprétation abstraite
  (accélération de point fixe dans le domaine abstrait des polyèdres).
- On ne supporte pas les calculs de coût en temps. Il sera simple d'ajouter un
  registre abstrait à la machine, incrémenté lors de l'exécution et de
  l'analyser. Mais l'hypothèse d'uniformité en coût d'une transition de la
  machine peut ne pas tenir dans les systèmes réels. La machine abstraite de
  Hume garantie qu'une transition a toujours une consommation bornée, mais cette
  borne cache de nombreux détails d'implémentation. [NDLR on pense
  immédiatement aux lancements du GC]
