stage/vasconcelos2008.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Notes: Space cost analysis using sized types</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">Notes: Space cost analysis using sized types</h1>

<div id="outline-container-org46af25c" class="outline-2">
<h2 id="org46af25c">Introduction</h2>
<div class="outline-text-2" id="text-org46af25c">
</div>
<div id="outline-container-org754089e" class="outline-3">
<h3 id="org754089e">Programmation embarquée</h3>
<div class="outline-text-3" id="text-org754089e">
<p>
On veut pouvoir utiliser des langages de haut niveaux dans les systèmes
embarqués pour des raison évidentes de productivité par rapport à C ou
l&rsquo;assembleur. Mais cela vient avec une perte de prédictabilité quand à la
correction et la consommation de ressources des programmes. Les tests et le
profilage ne suffisent pas à <i>garantir</i> le bon comportement des programmes de
haut niveaux dans les contextes embarqués: on y cherche des
performances prévisible et garanties plutôt meilleures à tout prix.
</p>

<p>
On distingue programmation <i>embarquée</i>, dans laquelle le programme doit jouer avec
des ressources limités génériques, et la programmation <i>en temps réel</i>, dans laquelle le
temps de réponse est la quantité bornée. Dans les systèmes embarqués
traditionnels, on garantie la terminaison et la correction en excluant les
constructions syntaxique les plus dangereuses (la récursion, l&rsquo;allocation
dynamique, les boucles sans bornes sup triviales&#x2026;). Mais le développement de
la programmation de haut niveau (java, python) sur micro-controlleurs et la
complexification des besoins en embarqué (IOT, exécution par un tierce partie)
ont créés de nouveaux besoins. (cf Stankovic 1988)
</p>
</div>
</div>
<div id="outline-container-orga76c8ac" class="outline-3">
<h3 id="orga76c8ac">Langages fonctionnels</h3>
<div class="outline-text-3" id="text-orga76c8ac">
<p>
Les langages fonctionnels permettent de garantir statiquement de bons invariants
<i>logiques</i> de programmes, mais pas de bons invariants <i>de ressources</i>. Pourquoi:
</p>
<dl class="org-dl">
<dt>fonctions d&rsquo;ordre supérieur</dt><dd>Le flux de contrôle du programme est dynamique,
et donc plus dur à évaluer. En C, le graphe de flux de contrôle est genérable
statiquement.</dd>
<dt>Copy-on-write data structures</dt><dd>Même dans les cas simple d&rsquo;un pipeline de
transformation, on a pas d&rsquo;assurance que l&rsquo;implémentation va générer un
programme travaillant en-place sur les structures déjà allouées.</dd>
<dt>le ramasse-miette</dt><dd>peut échouer à libérer la mémoire non-accessible dès
qu&rsquo;elle peut l&rsquo;être, voir peut échouer à la libérer tout court. Ils
obscurcissent la gestion mémoire.</dd>
<dt>sémantiques non-strictes</dt><dd>le coût d&rsquo;un calcul ne dépend pas que de ça
définition, mais aussi du contexte d&rsquo;évaluation. Par exemple:
<code>let null = fun [] -&gt; true | _::_ -&gt; false</code> n&rsquo;a pas besoin d&rsquo;évaluer
entièrement son argument. Il est plus complexe de prendre en compte ces
interaction appelant-appelé. Aussi, les thunks peuvent maintenir en vie des
ressources, et donc peuvent causer des fuites mémoires.</dd>
<dt>Optimisations</dt><dd>On veut garantir les consommation du programme à l&rsquo;exécution
à partir du code source. Entre les deux se tient un compilateur-optimisateur,
que l&rsquo;on doit prendre en compte. Il faut adapter les passes d&rsquo;optimisations.</dd>
</dl>
</div>
</div>
<div id="outline-container-orgdec62b9" class="outline-3">
<h3 id="orgdec62b9">Contribution</h3>
<div class="outline-text-3" id="text-orgdec62b9">
<p>
On cherche à étendre l&rsquo;application des langages fonctionnels à la programmation
critique et embarquée en créant une analyse automatique des consommations en
temps et mémoire des langages fonctionnels. Il s&rsquo;agit d&rsquo;une analyse statique
modulaire dirigée par les types pour prédire les bornes sup des consommations
mémoire. Les bornes sont exprimés par des compositions de fonctions familières
à croissance connues, en fonction non pas des valeurs des arguments, mais à partir
de grandeurs abstraites pertinentes extraites de leurs type.
</p>

<p>
On introduit un langage sur lequel porte l&rsquo;analyse: <i>Hume</i>. Il est fonctionnel
strict, avec types et fonctions récursives, mais son cœur est d&rsquo;ordre 1
uniquement. Il vient avec une machine abstraite à région mémoires et
ramasse-miette sans copie qui sert de modèle de coût pour ce langage. Cette
machine est basée sur SECD et est étendue pour supporter des optimisations
mémoires tractables pour l&rsquo;analyse. Contrairement aux travaux précédents, on
supporte les types et tailles définis par l&rsquo;utilisateur.
</p>

<p>
Notre contribution est limité de la manière suivante:
</p>
<ul class="org-ul">
<li>On se restreint à <i>Hume core</i>, une simplification de Hume de premier ordre.
Certaine constructions de Hume sont néanmoins admissibles dans Hume core.</li>
<li>On impose des contraintes linéaires entre les coût/les tailles. Cela permet de
garantir une analyse automatique par des technique d&rsquo;interprétation abstraite
(accélération de point fixe dans le domaine abstrait des polyèdres).</li>
<li>On ne supporte pas les calculs de coût en temps. Il sera simple d&rsquo;ajouter un
registre abstrait à la machine, incrémenté lors de l&rsquo;exécution et de
l&rsquo;analyser. Mais l&rsquo;hypothèse d&rsquo;uniformité en coût d&rsquo;une transition de la
machine peut ne pas tenir dans les systèmes réels. La machine abstraite de
Hume garantie qu&rsquo;une transition a toujours une consommation bornée, mais cette
borne cache de nombreux détails d&rsquo;implémentation. [NDLR on pense
immédiatement aux lancements du GC]</li>
</ul>
</div>
</div>
