posts/vasconcelos2008.org
** Exemple d'analyse
On considère le filtre simple, qui à un flux de flottant =x0,x1,...= renvoie un
flux =y0,y1,...= caractérisé par =yi = ∑(1≤k≤n) wk*x(i-k)=. Dans une
implémentation naïve en Haskell, il n'existe aucune garantie de libération des
éléments du premier flux quand ils ne sont plus nécessaires. Le ramasse miette
ne garantie pas non plus une borne précise de consommation mémoire pour cette
fonction.

En hume, on implémente un acteur synchrone qui génère le nouveau flux. La
dépendance entre (pre xs) et (post xs) est rendu explicite par la clause =wire=.
L'analyse statique détermine automatiquement que la liste qu'ils partagent un
invariant du programme.

#+BEGIN_SRC haskell
type Float = float 32 -- 32-bit floating point numbers
box fir
 in (x::Float, xs::[Float])
 out (y::Float, xs’::[Float])
match
 (x, xs) -> (dotp [0.5,2,0.5] xs, x:init xs)
wire fir.xs fir.xs’ initially [0,0,0]
#+END_SRC

Si on observe le type complet de =init=
=init : ∀n,m,s,h. < ∀a. List<n> a --(s,h)--> List<m> a | n=1+m, 0≤m, s≤6n-3,
h=3n-2>=
On remarque:
- la présence de paramètres de tailles dans les types =List<k>= garantissant que
  l'argument est non-vide (=0≤m=) et que la sortie contient un élément en plus (=n=m+1=).
- le type contient des informations de coût en pile et tas (=s= et =h=) et des
  bornes sur l'empreinte sur la pile et l'occupation mémoire. Ces propriétés
  ne sont pas purement dénotationnelle, mais demandent de fixer un modèle
  d'exécution (ici une machine virtuelle basée sur SECD).
- Le type est polymorphique en ses taille, et indique donc que l'implémentation
  est de consommation uniforme. Le polymorphisme permet d'avoir une analyse
  modulaire. On doit faire attention: les optimisations (comme la fusion)
  peuvent faire mentir le type obtenu (en fusionnant les créateurs et les
  consommateurs de structure par exemple).

  On extrait de l'analyse de type un système d'inéquations linéaires qui est
  automatiquement calculé par approximation de point fixe sur un treilli, comme
  en interprétation abstraite. On obtient au final:

  =fir.xs : Size ∈ [3,3], Stack ∈ [1,19], Heap ∈ [16,28]=
***
* Analyse de programme
** Objectif
Etendre le typage d'un langage pour y annoter des propriétés
dynamiques sur les valeurs, les calculs. Raisonner ensuite avec les outils de la
théorie des types. On raisonne uniquement sur des structures définies
inductivement, donc toujours modulo des equivalences [NDRL ie. dans des
groupoïdes].
** Premier exemple
On prend par exemple l'extension d'un λ-calcul simplement typé avec exceptions,
et un système d'effet modélisant ces exceptions: On a =Γ ⊢ e : t & φ=, avec φ un
ensemble d'exception, défini par =φ = ε | {e} | φ ∪ φ=. On implémente
inductivement l'égalité, l'appartenance, l'inclusion,... l'annotation des types
des fonctions avec l'ensemble des exceptions qu'elle peut lancer induit une une
relation de sous-typage simple sur les types annotées: On a

=a -(φ)-> b ≺ c -(ψ)->d iff. c ≺ a ∧ b ≺ d ∧ φ ⊂ ψ=

Et =≺= triviale autrement. Ce sous-typage est "shape-conformant", ce qui
simplifie l'inférence de type. Mais une relation de sous-typage plus complexe
peut améliorer la précision de l'analyse, en permettant de retarder
l'affaiblissement des effets (=φ⊂ψ=) jusqu'au point d'appel de la fonction analysée.
** Polymorphisme d'effets
On ajoute à notre système de type un =let= polymorphique, où l'on peut
quantifier sur les effets et les types. C'est essentiel pour une analyse fine
des paradigmes fonctionnels classique (plis, filtrage, nappage,...). On peut
alors typer, par exemple, la composition de fonction:

=compose : ∀a,b,c. ∀φ,ψ. (a -(φ)-> b) -> (b -(ψ)-> c) -> (a -(φ∪ψ)-> c)=

Pour notre système simple de lancement d'exception, le traitement du
polymorphisme est insidieusement simple: En général, il faut restreindre les
généralisation de type -- c'est à dire la liaison des variables libres sous un ∀
pour les domaines des formes =let=. Sinon, l'inférence est trop complexe
** Inférence
Le système d'effet exige de pouvoir "deviner" le type annoté d'expressions
quelconque. Il nous faut donc un algorithme d'inférence de type et d'effet. On
procède par /normalisation de preuves/: On restreint l'usage des règles de
typage non-structurelles à certains noeuds syntaxiques où l'on sait inférer les
types. Ici, on fait du /let-bound polymorphism/: les valeurs liées par des =let=
sont quantifiées au maximum sur leurs types et effets à la déclaration, puis
spécialisées au site d'utilisation de l'identifieur lié.

Avec notre relation de sous-effets moins forte que le sous-typage, ou peut
adapter l'algorithme /W/ de Damas. On restreint les annotations d'effets sur les
flèches à des variables fraiches uniquement, et on maintient séparément un
ensemble de contraintes de capacité =φ ⊂ ψ=. Alors, l'unification des types et
d'ordre 1, pour lequel on peut utiliser W. Sans séparer les contraintes, c'est
un problème d'unification modulo théorie des ensembles finis. Les contraintes
d'inclusion des effets sont résolues par un solveur à part.

Etendre cet approche avec une relation de sous-typage exigent "généralement"
(sic.) d'ajouter des contraintes d'inégalité de types afin d'inférer un typage
initial (au sens catégorique). La complétude de l'inférence de type dans ce cas
reste un problème ouvert, mais des algorithmes existent. Pour notre relation de
sous-typage /shape-conformant/, un algorithme en deux temps permet d'obtenir un
type pour tout terme, mais pas forcément son type initial. On procède en deux
temps:
- Inférence des types (/W/) et collecte des contraintes =φ ⊂ ψ=,
- Résolution des contraintes et mise-à-jour des types.

** Interprétation abstraite
/NDLR. C'est très classique, on mentionne vite fait les concepts déjà vu en TAS./
/On cite beaucoup le travail de Cousot&Cousot/
*** Concepts classiques
- Domaine abstrait en concret
- Structure de treillis sur ces domaines
- Connexion de Galois, et que faire quand il n'y en a pas
- Approximation de points fixes
- Opérateurs d'élargissement
- Treillis des intervalles
- Treillis des polyèdres convexes
