stage/vasconcelos2008.html
<div id="outline-container-org961613c" class="outline-3">
<h3 id="org961613c">Exemple d&rsquo;analyse</h3>
<div class="outline-text-3" id="text-org961613c">
<p>
On considère le filtre simple, qui à un flux de flottant <code>x0,x1,...</code> renvoie un
flux <code>y0,y1,...</code> caractérisé par <code>yi = ∑(1≤k≤n) wk*x(i-k)</code>. Dans une
implémentation naïve en Haskell, il n&rsquo;existe aucune garantie de libération des
éléments du premier flux quand ils ne sont plus nécessaires. Le ramasse miette
ne garantie pas non plus une borne précise de consommation mémoire pour cette
fonction.
</p>

<p>
En hume, on implémente un acteur synchrone qui génère le nouveau flux. La
dépendance entre (pre xs) et (post xs) est rendu explicite par la clause <code>wire</code>.
L&rsquo;analyse statique détermine automatiquement que la liste qu&rsquo;ils partagent un
invariant du programme.
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #3b6ea8;">type</span> <span style="color: #9a7500;">Float</span> <span style="color: #cb9aad;">=</span> float <span style="color: #97365b; font-weight: bold;">32</span> <span style="color: #b1b1b1;">-- </span><span style="color: #b1b1b1;">32-bit floating point numbers</span>
<span style="color: #29838d;">box</span> fir
 <span style="color: #3b6ea8;">in</span> (x<span style="color: #cb9aad;">::</span><span style="color: #9a7500;">Float</span>, xs<span style="color: #cb9aad;">::</span>[<span style="color: #9a7500;">Float</span>])
 out (y<span style="color: #cb9aad;">::</span><span style="color: #9a7500;">Float</span>, xs&#8217;<span style="color: #cb9aad;">::</span>[<span style="color: #9a7500;">Float</span>])
<span style="color: #29838d;">match</span>
 (x, xs) <span style="color: #cb9aad;">-&gt;</span> (dotp [<span style="color: #97365b; font-weight: bold;">0.5</span>,<span style="color: #97365b; font-weight: bold;">2</span>,<span style="color: #97365b; font-weight: bold;">0.5</span>] xs, x<span style="color: #9a7500;">:</span>init xs)
<span style="color: #29838d;">wire</span> fir<span style="color: #cb9aad;">.</span>xs fir<span style="color: #cb9aad;">.</span>xs&#8217; initially [<span style="color: #97365b; font-weight: bold;">0</span>,<span style="color: #97365b; font-weight: bold;">0</span>,<span style="color: #97365b; font-weight: bold;">0</span>]
</pre>
</div>

<p>
Si on observe le type complet de <code>init</code>
<code>init : ∀n,m,s,h. &lt; ∀a. List&lt;n&gt; a --(s,h)--&gt; List&lt;m&gt; a | n=1+m, 0≤m, s≤6n-3,
h=3n-2&gt;</code>
On remarque:
</p>
<ul class="org-ul">
<li>la présence de paramètres de tailles dans les types <code>List&lt;k&gt;</code> garantissant que
l&rsquo;argument est non-vide (<code>0≤m</code>) et que la sortie contient un élément en plus (<code>n=m+1</code>).</li>
<li>le type contient des informations de coût en pile et tas (<code>s</code> et <code>h</code>) et des
bornes sur l&rsquo;empreinte sur la pile et l&rsquo;occupation mémoire. Ces propriétés
ne sont pas purement dénotationnelle, mais demandent de fixer un modèle
d&rsquo;exécution (ici une machine virtuelle basée sur SECD).</li>
<li><p>
Le type est polymorphique en ses taille, et indique donc que l&rsquo;implémentation
est de consommation uniforme. Le polymorphisme permet d&rsquo;avoir une analyse
modulaire. On doit faire attention: les optimisations (comme la fusion)
peuvent faire mentir le type obtenu (en fusionnant les créateurs et les
consommateurs de structure par exemple).
</p>

<p>
On extrait de l&rsquo;analyse de type un système d&rsquo;inéquations linéaires qui est
automatiquement calculé par approximation de point fixe sur un treilli, comme
en interprétation abstraite. On obtient au final:
</p>

<p>
<code>fir.xs : Size ∈ [3,3], Stack ∈ [1,19], Heap ∈ [16,28]</code>
</p></li>
</ul>
<p>
<b>*</b>
</p>
</div>
</div>
</div>
<div id="outline-container-org8483f00" class="outline-2">
<h2 id="org8483f00">Analyse de programme</h2>
<div class="outline-text-2" id="text-org8483f00">
</div>
<div id="outline-container-org196a79f" class="outline-3">
<h3 id="org196a79f">Objectif</h3>
<div class="outline-text-3" id="text-org196a79f">
<p>
Etendre le typage d&rsquo;un langage pour y annoter des propriétés
dynamiques sur les valeurs, les calculs. Raisonner ensuite avec les outils de la
théorie des types. On raisonne uniquement sur des structures définies
inductivement, donc toujours modulo des equivalences [NDRL ie. dans des
groupoïdes].
</p>
</div>
</div>
<div id="outline-container-orgca43fde" class="outline-3">
<h3 id="orgca43fde">Premier exemple</h3>
<div class="outline-text-3" id="text-orgca43fde">
<p>
On prend par exemple l&rsquo;extension d&rsquo;un λ-calcul simplement typé avec exceptions,
et un système d&rsquo;effet modélisant ces exceptions: On a <code>Γ ⊢ e : t &amp; φ</code>, avec φ un
ensemble d&rsquo;exception, défini par <code>φ = ε | {e} | φ ∪ φ</code>. On implémente
inductivement l&rsquo;égalité, l&rsquo;appartenance, l&rsquo;inclusion,&#x2026; l&rsquo;annotation des types
des fonctions avec l&rsquo;ensemble des exceptions qu&rsquo;elle peut lancer induit une une
relation de sous-typage simple sur les types annotées: On a
</p>

<p>
<code>a -(φ)-&gt; b ≺ c -(ψ)-&gt;d iff. c ≺ a ∧ b ≺ d ∧ φ ⊂ ψ</code>
</p>

<p>
Et <code>≺</code> triviale autrement. Ce sous-typage est &ldquo;shape-conformant&rdquo;, ce qui
simplifie l&rsquo;inférence de type. Mais une relation de sous-typage plus complexe
peut améliorer la précision de l&rsquo;analyse, en permettant de retarder
l&rsquo;affaiblissement des effets (<code>φ⊂ψ</code>) jusqu&rsquo;au point d&rsquo;appel de la fonction analysée.
</p>
</div>
</div>
<div id="outline-container-orgde9859d" class="outline-3">
<h3 id="orgde9859d">Polymorphisme d&rsquo;effets</h3>
<div class="outline-text-3" id="text-orgde9859d">
<p>
On ajoute à notre système de type un <code>let</code> polymorphique, où l&rsquo;on peut
quantifier sur les effets et les types. C&rsquo;est essentiel pour une analyse fine
des paradigmes fonctionnels classique (plis, filtrage, nappage,&#x2026;). On peut
alors typer, par exemple, la composition de fonction:
</p>

<p>
<code>compose : ∀a,b,c. ∀φ,ψ. (a -(φ)-&gt; b) -&gt; (b -(ψ)-&gt; c) -&gt; (a -(φ∪ψ)-&gt; c)</code>
</p>

<p>
Pour notre système simple de lancement d&rsquo;exception, le traitement du
polymorphisme est insidieusement simple: En général, il faut restreindre les
généralisation de type &#x2013; c&rsquo;est à dire la liaison des variables libres sous un ∀
pour les domaines des formes <code>let</code>. Sinon, l&rsquo;inférence est trop complexe
</p>
</div>
</div>
<div id="outline-container-orga53b51d" class="outline-3">
<h3 id="orga53b51d">Inférence</h3>
<div class="outline-text-3" id="text-orga53b51d">
<p>
Le système d&rsquo;effet exige de pouvoir &ldquo;deviner&rdquo; le type annoté d&rsquo;expressions
quelconque. Il nous faut donc un algorithme d&rsquo;inférence de type et d&rsquo;effet. On
procède par <i>normalisation de preuves</i>: On restreint l&rsquo;usage des règles de
typage non-structurelles à certains noeuds syntaxiques où l&rsquo;on sait inférer les
types. Ici, on fait du <i>let-bound polymorphism</i>: les valeurs liées par des <code>let</code>
sont quantifiées au maximum sur leurs types et effets à la déclaration, puis
spécialisées au site d&rsquo;utilisation de l&rsquo;identifieur lié.
</p>

<p>
Avec notre relation de sous-effets moins forte que le sous-typage, ou peut
adapter l&rsquo;algorithme <i>W</i> de Damas. On restreint les annotations d&rsquo;effets sur les
flèches à des variables fraiches uniquement, et on maintient séparément un
ensemble de contraintes de capacité <code>φ ⊂ ψ</code>. Alors, l&rsquo;unification des types et
d&rsquo;ordre 1, pour lequel on peut utiliser W. Sans séparer les contraintes, c&rsquo;est
un problème d&rsquo;unification modulo théorie des ensembles finis. Les contraintes
d&rsquo;inclusion des effets sont résolues par un solveur à part.
</p>

<p>
Etendre cet approche avec une relation de sous-typage exigent &ldquo;généralement&rdquo;
(sic.) d&rsquo;ajouter des contraintes d&rsquo;inégalité de types afin d&rsquo;inférer un typage
initial (au sens catégorique). La complétude de l&rsquo;inférence de type dans ce cas
reste un problème ouvert, mais des algorithmes existent. Pour notre relation de
sous-typage <i>shape-conformant</i>, un algorithme en deux temps permet d&rsquo;obtenir un
type pour tout terme, mais pas forcément son type initial. On procède en deux
temps:
</p>
<ul class="org-ul">
<li>Inférence des types (<i>W</i>) et collecte des contraintes <code>φ ⊂ ψ</code>,</li>
<li>Résolution des contraintes et mise-à-jour des types.</li>
</ul>
</div>
</div>

<div id="outline-container-org214e131" class="outline-3">
<h3 id="org214e131">Interprétation abstraite</h3>
<div class="outline-text-3" id="text-org214e131">
<p>
<i>NDLR. C&rsquo;est très classique, on mentionne vite fait les concepts déjà vu en TAS.</i>
<i>On cite beaucoup le travail de Cousot&amp;Cousot</i>
</p>
</div>
<div id="outline-container-orgad62101" class="outline-4">
<h4 id="orgad62101">Concepts classiques</h4>
<div class="outline-text-4" id="text-orgad62101">
<ul class="org-ul">
<li>Domaine abstrait en concret</li>
<li>Structure de treillis sur ces domaines</li>
<li>Connexion de Galois, et que faire quand il n&rsquo;y en a pas</li>
<li>Approximation de points fixes</li>
<li>Opérateurs d&rsquo;élargissement</li>
<li>Treillis des intervalles</li>
<li>Treillis des polyèdres convexes</li>
</ul>
</div>
</div>
