posts/vasconcelos2008.org
*** Élargissement avec carburant
On commence l'itération de point fixe avec un nombre fini de carburant. Quand
l'usage de l'élargissement causerais une perte de précision, on consomme un
carburant et on fait une itération simple. Quand on a plus de carburant, on
élargi même si on perd de la précision. Cela est utile pour la convergence des
polyèdres.
Voir /Bagnara et al., Generation of ba- sic semi-algebraic invariants using
convex polyhedra/ pour plus d'information au besoin
* Analyse statique de consommation de ressource
** Analyse de complexité automatique
*** Préhistoire et système METRIC
On cherche a simuler/aider/automatiser les analyses manuelles de complexité
temporelle asymptotique de programmes. On procède comme un humain:
- Trouver une relation de récurrence sur le programme;
- En extraire une récurrence sur la compléxité,
- Avec une métrique d'entrée pertinente;
- Résoudre la relation, si possible.

Le premier de ces système, /METRIC/ (1975) suit de près les travaux séminaux de
Knuth (1973). On passe au relation entière en donnant un coût à chaque
primitive. Le résultat idéal est une formule close portant sur le coût de ces
primitive et soit la longueur en tant que liste des arguments, ou leur taille en
temps de S-expression.

Les métriques étudiés doivent être cumulatives et analytiques, donc on ne peut
pas mesurer la taille maximale de la pile. On peut néanmoins compter le nombre
de cellules /CONS/ allouées avec une métrique ou /CONS/ est de coût 1 et le
reste gratuit. Les types utilisateurs de sont analysés que comme S-expressions.
Enfin, l'hypothèse d'accumulation du temps n'est pas valide dans les sémantiques
non-strictes. Ce sera une épine récurrente.
*** Le système ACE de Métayer (1988)
Une nouvelle approche, basée sur la réécriture équationnelle. Le langage ciblé
est fonctionnel, applicatif, à base de combinateur, et est donc bien adapté au
problème. ACE produit une analyse au pire cas et asymptotique. Il procède par
réécriture selon l'algèbre applicative et le /principe d'induction récursive/ de
McCarthy : "Deux fonctions satisfaisant la même relatinon de récurrence sont
égale sur le domaine défini par point fixe par le bas de la relation". Le
système de réécriture contient plus de 1000 règles entrées manuellement, sans
étude (encore moins automatique) de leurs cohérence, ce qui aurait demandé bien
trop de travail (on est en 1988 tout de même). L'analyse de dit pas si le terme
asymptotique peut être dominé par les premiers termes, et ne supporte dans
l'analyse de la consommation mémoire.
*** Ensuite
- Rosendahl (1989) :: utilise l'interprétation abstraite pour définir une
  transformation de programme permettant d'associer, pour un préfixe d'entrée,
  une borne supérieure de la consommation de temps.
- Liu&Gomez (1998) :: ont une approche semblable à du profilage: on peut exécuter
  symboliquement le programme transformé pour obtenir des relations de récurrence
  sur le temps d'exécution à partir d'entrée partielle. On n'obtient pas de
  forme closes de ces relations.
- Walder (1988) :: brise le plafond de verre en proposant une analyse
  asymptomatique, et modulaire en présence de sémantique non-stricte, utilisant
  des /transformeurs de projection/ décrivant la "paresse" des fonctions
  analysées. Il n'est pas allé jusqu'à un algorithme d'analyse.
- Sands (1990) :: a créé plusieurs théories pour l'analyse des programmes
  fonctionnels avec fonctions d'ordre supérieur et évaluation paresseuse. Il
  peut ainsi obtenir des bornes [temps nécéssaire, temps suffisant] pour les
  fonctions paresseuses.
*** Conclusion
Ces formalismes ont pour but d'assister l'analyse asymptotique manuelle
d'algorithmes, et donc ne considèrent pas:
- L'automatisation des techniques d'analyse
- Les coûts d'exécution réels des programmes: On compte de nombre d'appels
  récursifs des fonctions.
** Système de type et d'effets pour le WCET
*** Travaux de Dornic & al
 Dornic&al. (1992) propose un "système de temps" pour un langage d'ordre
  supérieur à sémantique call-by-value. Une version spécialisé d'un système
  permettant de raisonner statiquement sur une classe de propriétés
  /intentionnelles/ des programmes à l'exécution. Les jugements de typages sont
  annotés d'un coût arithmétique entier. Les flèches sont annotés d'un coût
  latent de leur exécution.

  Le système devient intéressant quand on peut quantifier sur les coûts latent,
  ce qui permet de typer le coût les fonctions d'ordre supérieur en fonction du
  coût latent de leur argument.

  Mais de nombreuses limites:
  + Les fonctions récursives sont annotés avec un temps =long=, car pas de
    raisonnement sur la taille des arguments.
  + Pas de sous-typage des effets. Il est donc impossible de typer les jointures
    de deux calculs au coût différents, comme les deux branches d'une conditionnelle.
  + Pas d'inférence. Le problème sera résolu plus tard (1994)
*** Extensions
ce système a été étendu par Reistad & Gifford avec des annotation pour les
tailles des entiers naturels, des listes et des vecteurs. Ces annotations sont
des bornes sup statiques des tailles dynamiques des valeurs. Ils reconstruisent
les types et effets dans un système d'effets algébrique. Par exemple:

=succ : ∀n. Nat(n) -(1)-> >Nat(n+1)=
=map : ∀a,b,c,l. (a -(c)-> b) × List(a,n) -(k0+l*(k1+c))-> List(b,n)=


On remarque le polymorphisme de taille sur les arguments, qui permet de donner
un coût aux fonctions d'ordre supérieur usuelles. Comme le système de Dornic &
al., on ne gère pas la récursion, donc les types de ces schéma de récursions
primitif doivent être donnés.

=sub : ∀n,m. Nat(n) × Nat(m) -(c)-> Nat(n)= =twice succ : Nat long -(7)-> Nat
long=

On doit surestimer les tailles des résultats des fonctions
non-croissantes: on a =Nat(n)= en résultat de =seb=, alors que =Nat(n-m)= est
plus précis (et souhaitable). Enfin, le manque de polymorphisme cause des
surestimations de tailles. Dans le dernier exemple, on ne peux par obtenir le
typage souhaitable =Nat(n) -(7)-> Nat(n+2)=, par il faudra =succ= avec deux
types différents.

Une solution, de Loild (1998), consiste à étendre le système avec les types
intersections. Cela permet de spécialiser les fonctions polymorphiques sur
plusieurs arguments en parallèle, et donc de typer la double application de
=succ= de la forme =Nat(n) --> Nat(n+1) --> Nat(n+2)=

Finalement, Vasconcelos & Hammond (2004) ont étendu cette technique aux
définitions récurrentes, laissant le soin à l'utilisateur ou à un système
d'algèbre automatisé de clore les relations de récurrences. Les problèmes de
METRIC apparaissent aussi ici. On note aussi que l'approche se casse les dents
sur les algorithmes diviser-pour-régner tels que quicksort.

** Sized Types
