stage/vasconcelos2008.html
<div id="outline-container-org58da6ca" class="outline-4">
<h4 id="org58da6ca">Élargissement avec carburant</h4>
<div class="outline-text-4" id="text-org58da6ca">
<p>
On commence l&rsquo;itération de point fixe avec un nombre fini de carburant. Quand
l&rsquo;usage de l&rsquo;élargissement causerais une perte de précision, on consomme un
carburant et on fait une itération simple. Quand on a plus de carburant, on
élargi même si on perd de la précision. Cela est utile pour la convergence des
polyèdres.
Voir <i>Bagnara et al., Generation of ba- sic semi-algebraic invariants using
convex polyhedra</i> pour plus d&rsquo;information au besoin
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgabf5079" class="outline-2">
<h2 id="orgabf5079">Analyse statique de consommation de ressource</h2>
<div class="outline-text-2" id="text-orgabf5079">
</div>
<div id="outline-container-org76a9941" class="outline-3">
<h3 id="org76a9941">Analyse de complexité automatique</h3>
<div class="outline-text-3" id="text-org76a9941">
</div>
<div id="outline-container-org3864c95" class="outline-4">
<h4 id="org3864c95">Préhistoire et système METRIC</h4>
<div class="outline-text-4" id="text-org3864c95">
<p>
On cherche a simuler/aider/automatiser les analyses manuelles de complexité
temporelle asymptotique de programmes. On procède comme un humain:
</p>
<ul class="org-ul">
<li>Trouver une relation de récurrence sur le programme;</li>
<li>En extraire une récurrence sur la compléxité,</li>
<li>Avec une métrique d&rsquo;entrée pertinente;</li>
<li>Résoudre la relation, si possible.</li>
</ul>

<p>
Le premier de ces système, <i>METRIC</i> (1975) suit de près les travaux séminaux de
Knuth (1973). On passe au relation entière en donnant un coût à chaque
primitive. Le résultat idéal est une formule close portant sur le coût de ces
primitive et soit la longueur en tant que liste des arguments, ou leur taille en
temps de S-expression.
</p>

<p>
Les métriques étudiés doivent être cumulatives et analytiques, donc on ne peut
pas mesurer la taille maximale de la pile. On peut néanmoins compter le nombre
de cellules <i>CONS</i> allouées avec une métrique ou <i>CONS</i> est de coût 1 et le
reste gratuit. Les types utilisateurs de sont analysés que comme S-expressions.
Enfin, l&rsquo;hypothèse d&rsquo;accumulation du temps n&rsquo;est pas valide dans les sémantiques
non-strictes. Ce sera une épine récurrente.
</p>
</div>
</div>
<div id="outline-container-org650d8e9" class="outline-4">
<h4 id="org650d8e9">Le système ACE de Métayer (1988)</h4>
<div class="outline-text-4" id="text-org650d8e9">
<p>
Une nouvelle approche, basée sur la réécriture équationnelle. Le langage ciblé
est fonctionnel, applicatif, à base de combinateur, et est donc bien adapté au
problème. ACE produit une analyse au pire cas et asymptotique. Il procède par
réécriture selon l&rsquo;algèbre applicative et le <i>principe d&rsquo;induction récursive</i> de
McCarthy : &ldquo;Deux fonctions satisfaisant la même relatinon de récurrence sont
égale sur le domaine défini par point fixe par le bas de la relation&rdquo;. Le
système de réécriture contient plus de 1000 règles entrées manuellement, sans
étude (encore moins automatique) de leurs cohérence, ce qui aurait demandé bien
trop de travail (on est en 1988 tout de même). L&rsquo;analyse de dit pas si le terme
asymptotique peut être dominé par les premiers termes, et ne supporte dans
l&rsquo;analyse de la consommation mémoire.
</p>
</div>
</div>
<div id="outline-container-org6be31a4" class="outline-4">
<h4 id="org6be31a4">Ensuite</h4>
<div class="outline-text-4" id="text-org6be31a4">
<dl class="org-dl">
<dt>Rosendahl (1989)</dt><dd>utilise l&rsquo;interprétation abstraite pour définir une
transformation de programme permettant d&rsquo;associer, pour un préfixe d&rsquo;entrée,
une borne supérieure de la consommation de temps.</dd>
<dt>Liu&amp;Gomez (1998)</dt><dd>ont une approche semblable à du profilage: on peut exécuter
symboliquement le programme transformé pour obtenir des relations de récurrence
sur le temps d&rsquo;exécution à partir d&rsquo;entrée partielle. On n&rsquo;obtient pas de
forme closes de ces relations.</dd>
<dt>Walder (1988)</dt><dd>brise le plafond de verre en proposant une analyse
asymptomatique, et modulaire en présence de sémantique non-stricte, utilisant
des <i>transformeurs de projection</i> décrivant la &ldquo;paresse&rdquo; des fonctions
analysées. Il n&rsquo;est pas allé jusqu&rsquo;à un algorithme d&rsquo;analyse.</dd>
<dt>Sands (1990)</dt><dd>a créé plusieurs théories pour l&rsquo;analyse des programmes
fonctionnels avec fonctions d&rsquo;ordre supérieur et évaluation paresseuse. Il
peut ainsi obtenir des bornes [temps nécéssaire, temps suffisant] pour les
fonctions paresseuses.</dd>
</dl>
</div>
</div>
<div id="outline-container-orgf57140d" class="outline-4">
<h4 id="orgf57140d">Conclusion</h4>
<div class="outline-text-4" id="text-orgf57140d">
<p>
Ces formalismes ont pour but d&rsquo;assister l&rsquo;analyse asymptotique manuelle
d&rsquo;algorithmes, et donc ne considèrent pas:
</p>
<ul class="org-ul">
<li>L&rsquo;automatisation des techniques d&rsquo;analyse</li>
<li>Les coûts d&rsquo;exécution réels des programmes: On compte de nombre d&rsquo;appels
récursifs des fonctions.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org85f0d45" class="outline-3">
<h3 id="org85f0d45">Système de type et d&rsquo;effets pour le WCET</h3>
<div class="outline-text-3" id="text-org85f0d45">
</div>
<div id="outline-container-org6b0ff3c" class="outline-4">
<h4 id="org6b0ff3c">Travaux de Dornic &amp; al</h4>
<div class="outline-text-4" id="text-org6b0ff3c">
<p>
Dornic&amp;al. (1992) propose un &ldquo;système de temps&rdquo; pour un langage d&rsquo;ordre
 supérieur à sémantique call-by-value. Une version spécialisé d&rsquo;un système
 permettant de raisonner statiquement sur une classe de propriétés
 <i>intentionnelles</i> des programmes à l&rsquo;exécution. Les jugements de typages sont
 annotés d&rsquo;un coût arithmétique entier. Les flèches sont annotés d&rsquo;un coût
 latent de leur exécution.
</p>

<p>
Le système devient intéressant quand on peut quantifier sur les coûts latent,
ce qui permet de typer le coût les fonctions d&rsquo;ordre supérieur en fonction du
coût latent de leur argument.
</p>

<p>
Mais de nombreuses limites:
</p>
<ul class="org-ul">
<li>Les fonctions récursives sont annotés avec un temps <code>long</code>, car pas de
raisonnement sur la taille des arguments.</li>
<li>Pas de sous-typage des effets. Il est donc impossible de typer les jointures
de deux calculs au coût différents, comme les deux branches d&rsquo;une conditionnelle.</li>
<li>Pas d&rsquo;inférence. Le problème sera résolu plus tard (1994)</li>
</ul>
</div>
</div>
<div id="outline-container-orgb82475a" class="outline-4">
<h4 id="orgb82475a">Extensions</h4>
<div class="outline-text-4" id="text-orgb82475a">
<p>
ce système a été étendu par Reistad &amp; Gifford avec des annotation pour les
tailles des entiers naturels, des listes et des vecteurs. Ces annotations sont
des bornes sup statiques des tailles dynamiques des valeurs. Ils reconstruisent
les types et effets dans un système d&rsquo;effets algébrique. Par exemple:
</p>

<p>
<code>succ : ∀n. Nat(n) -(1)-&gt; &gt;Nat(n+1)</code>
<code>map : ∀a,b,c,l. (a -(c)-&gt; b) × List(a,n) -(k0+l*(k1+c))-&gt; List(b,n)</code>
</p>


<p>
On remarque le polymorphisme de taille sur les arguments, qui permet de donner
un coût aux fonctions d&rsquo;ordre supérieur usuelles. Comme le système de Dornic &amp;
al., on ne gère pas la récursion, donc les types de ces schéma de récursions
primitif doivent être donnés.
</p>

<p>
<code>sub : ∀n,m. Nat(n) × Nat(m) -(c)-&gt; Nat(n)</code> <code>twice succ : Nat long -(7)-&gt; Nat
long</code>
</p>

<p>
On doit surestimer les tailles des résultats des fonctions
non-croissantes: on a <code>Nat(n)</code> en résultat de <code>seb</code>, alors que <code>Nat(n-m)</code> est
plus précis (et souhaitable). Enfin, le manque de polymorphisme cause des
surestimations de tailles. Dans le dernier exemple, on ne peux par obtenir le
typage souhaitable <code>Nat(n) -(7)-&gt; Nat(n+2)</code>, par il faudra <code>succ</code> avec deux
types différents.
</p>

<p>
Une solution, de Loild (1998), consiste à étendre le système avec les types
intersections. Cela permet de spécialiser les fonctions polymorphiques sur
plusieurs arguments en parallèle, et donc de typer la double application de
<code>succ</code> de la forme <code>Nat(n) --&gt; Nat(n+1) --&gt; Nat(n+2)</code>
</p>

<p>
Finalement, Vasconcelos &amp; Hammond (2004) ont étendu cette technique aux
définitions récurrentes, laissant le soin à l&rsquo;utilisateur ou à un système
d&rsquo;algèbre automatisé de clore les relations de récurrences. Les problèmes de
METRIC apparaissent aussi ici. On note aussi que l&rsquo;approche se casse les dents
sur les algorithmes diviser-pour-régner tels que quicksort.
</p>
</div>
</div>
</div>
