posts/vasconcelos2008.org
*** Hughes, Pareto, Sabry (1996-2000)
Il existe des systèmes de types pour la déduction de propriétés de tailles
uniquement, pour les preuves de terminaisons, ou les optimisations. Les autheurs
présentent en 1996 un système de type étendu aux tailles pour prouver la
terminaison des programmes embarqués, et la propriétés /co/-respondante, la
productivité des programmes co-récursifs (comme les streams).

Les types des constructeurs sont annotés avec des bornes sup des tailles des
données construites pour les types récursifs, et des bornes sup pour les types
co-récursifs. Ces bornes sont limités à l'arithmétique de Presburger pour la
décidabilité, donc pas de multiplication native.

#+BEGIN_SRC
zero : Nat_{1}
succ : ∀i. Nat_{i} -> Nat_{i+1}

mk_stream : ∀i. ∀a. a -> Stream^{i} a -> Stream^{i+1} a
#+END_SRC

La relation d'ordre sur les tailles induit un sous-typage structurel sur les
sized types. On note ω la taille arbitrairement grande. Donc, =∀i. Nat_{i} ⊂
Nat_{ω}= On peut alors typer les expressions du genre

#+BEGIN_SRC
if cond then (??? : List_{i} a) else (??? : List_{j} a) : List_{k} a
#+END_SRC

en sur-approximant la taille de la branche la plus petite. On fini avec =k=max i
j= sans pour autant avoir l'opérateur =max= dans le système de type. La régle de
la récurrence (nouvelle) permet la récursion primitive sur les types à taille,
garantissant la terminaison des fonctions récursives et la productivité des
fonctions co-récursives.

On encode naturellement les récursions primitives sur les entiers et les
listes, et on peut aménager un polymorphisme de taille pour gérer les arguments
accumulateur des fonctions taill-call récursives comme =reverse=. Mais il faut
alors abandonner le polymorphisme classique pour garder la décidabilité de
l'analyse.

Les schéma de récursions non-linéaires ne sont pas aussi bien gérés. Prenons
l'exemple de =quicksort=: pour la fonction auxiliaire =pivot : ∀t. t -> list t
-> list t * list t=, la meilleure approximation est :

=pivot : ∀t. ∀i. t -> list_{i} t -> list_{i} t * list_{i} t=

mais la "bonne" approximation, qui permet de garantir la spécification de
=quicksort= serait:

=pivot : ∀t. ∀i,j. t -> list_{i+j} t -> list_{i} t * list_{j} t=,

mais on ne peut pas induire sur les sommes !

*** /Embedded ML/ : Hughes & Pareto (1999)

Extension de leurs système à un langage de programmation à la ML, avec
sémantique opérationelle à petit-pas basée sur la SECD, avec analyse des coûts
de pile et tas. On ajoute une primitive d'allocation de mémoire =letregion ρ#e
in e= où =ρ#e= est une nouvelle région mémoire de capacité dynamique.

Ce n'est hélas pas suffisant pour l'espace mémoire d'instant de système
synchrone, car la récursion peut créer des piles de régions. Le système est donc
augmenté d'un /region resetting/. Aussi, on ne peut pas implémenter les
structures infinies commes les streams.

*** Chin, Khoo (2001-2006)

Chin&Khoo ont un système avec inférence, basé sur l'arithmétique de Presburger,
qui est décidable (en passant par Omega). Il gèrent la récurrence avec une
opération de /fermeture transitive des contraintes linéaires/ permettant de
"fermer la boucle": passer d'une étape de récurrence au calcul complet.

/Exemple de résultat: =append=/
#+BEGIN_SRC
append : list_{m} t -> list_{n} t -> list{l} t
avec:
  - m ≥ 0, n ≥ 0, l = m + n
  - m > m' ≥ 0, n' = n
#+END_SRC
=n'= et =m'= sont les tailles à l'étape de récursion suivante. (comme une sorte
de post/pre)

On s'intéresse à des propriétés de /sécurité/, pas de /liveliness/ ou de
/productivité/ comme chez Hughes & Pareto. Chaque type possède sa propre notion
de taille: p.ex les booléens sont de taille 0 ou 1. On peut alors typer =null=
sur les listes de la manière suivante:

#+BEGIN_SRC
null : List_{n} a -> bool_{c} s.t. (n = 0 ∧ c = 1) ∨ (n > 0 ∧ c = 0)
#+END_SRC

Ca ressemble à ce qu'on peut faire avec des GADT, il faudra regarder ce lien de
plus près. On pourrait faire une équivalence entre les variables fantôme des
GADT (empty | nonempty) et des invariants de tailles (n = 0 | n > 0). On ferra
attention à ne pas oublier qu'on travaille à l'ordre supérieur. La discipline de
typage de Chin & Khoo n'a pas de preuve valide pour les types d'ordre
supérieurs. Leur preuve implique l'existence de contraintes décrivant exactement
la taille d'une valeur annoté d'un certain type. Ces contraintes n'existent pas
à l'ordre supérieure.

** Types Dépendants

*** /Dependent ML/

Créé en 1999, /dependent ML/ (DML) est une extension d'OCaml avec types
dépendants, mais relativement conservative. On y maintient la décidabilité du
typage et on s'y efforce de maintenir les annotations des types dépendants au
minimum. DML sépare les valeurs classique d'OCaml des /indices/ présents dans
les types, qui sont pris dans un domaine de contraintes décidables. On peut par
exemple utiliser des indices dans ℕ avec l'arithmétique de Presburger, qui sont
ensuite résolus par Omega: l'évaluation des indices est limitée à la
normalisation des contraintes.

Les types dépendants sont introduits par des raffinement de types afin de ne pas
avoir à changer le code non-dépendants. ={v:T} U= introduit le produit Π(v:T)U
et =[v:T | P]= introduit la somme Σ(v:T)P.

#+BEGIN_SRC
append <| {m:nat}{n:nat} 'a list(m) * 'a list(n) -> 'a list(m+n)
filter <| ('a -> bool) * {n:nat} 'a list(n) -> [m:nat| m<=n] 'a list(m)
#+END_SRC


- Avantage :: On peut définir nos propres notions de tailles, alors qu'avec les
  /Sized Types/ la notion est rigide.
- Inconvénient :: On ne résout par le problème de l'inférence, au contraire !
  On est passé au problème de l'inférence des types dépendants...

Grobauer a utilisé DML pour inférer des relations de récurrences sur les coûts
des calculs, mais ils faut encore les résoudre à la main.

*** LXres (Crary & Weirich)

/LXres/ est un langage de programmation avec type dépendants et
code-comme-preuve permettant d'exposer des "horloges virtuelles" au niveau des
types, et donc de mesurer les coûts liés à ces horloges. Ces estimations de
coûts sont des /fonctions primitives récursives/, un formalisme puissant pour le
problème en question. (En comparaison à, par exemple, l'arithmétique de
Presburger).

