stage/vasconcelos2008.html

<div id="outline-container-org6d643da" class="outline-3">
<h3 id="org6d643da">Sized Types</h3>
<div class="outline-text-3" id="text-org6d643da">
</div>
<div id="outline-container-orgdec5c56" class="outline-4">
<h4 id="orgdec5c56">Hughes, Pareto, Sabry (1996-2000)</h4>
<div class="outline-text-4" id="text-orgdec5c56">
<p>
Il existe des systèmes de types pour la déduction de propriétés de tailles
uniquement, pour les preuves de terminaisons, ou les optimisations. Les autheurs
présentent en 1996 un système de type étendu aux tailles pour prouver la
terminaison des programmes embarqués, et la propriétés <i>co</i>-respondante, la
productivité des programmes co-récursifs (comme les streams).
</p>

<p>
Les types des constructeurs sont annotés avec des bornes sup des tailles des
données construites pour les types récursifs, et des bornes sup pour les types
co-récursifs. Ces bornes sont limités à l&rsquo;arithmétique de Presburger pour la
décidabilité, donc pas de multiplication native.
</p>

<pre class="example">
zero : Nat_{1}
succ : ∀i. Nat_{i} -&gt; Nat_{i+1}

mk_stream : ∀i. ∀a. a -&gt; Stream^{i} a -&gt; Stream^{i+1} a
</pre>

<p>
La relation d&rsquo;ordre sur les tailles induit un sous-typage structurel sur les
sized types. On note ω la taille arbitrairement grande. Donc, <code>∀i. Nat_{i} ⊂
Nat_{ω}</code> On peut alors typer les expressions du genre
</p>

<pre class="example">
if cond then (??? : List_{i} a) else (??? : List_{j} a) : List_{k} a
</pre>

<p>
en sur-approximant la taille de la branche la plus petite. On fini avec <code>k=max i
j</code> sans pour autant avoir l&rsquo;opérateur <code>max</code> dans le système de type. La régle de
la récurrence (nouvelle) permet la récursion primitive sur les types à taille,
garantissant la terminaison des fonctions récursives et la productivité des
fonctions co-récursives.
</p>

<p>
On encode naturellement les récursions primitives sur les entiers et les
listes, et on peut aménager un polymorphisme de taille pour gérer les arguments
accumulateur des fonctions taill-call récursives comme <code>reverse</code>. Mais il faut
alors abandonner le polymorphisme classique pour garder la décidabilité de
l&rsquo;analyse.
</p>

<p>
Les schéma de récursions non-linéaires ne sont pas aussi bien gérés. Prenons
l&rsquo;exemple de <code>quicksort</code>: pour la fonction auxiliaire <code>pivot : ∀t. t -&gt; list t
-&gt; list t * list t</code>, la meilleure approximation est :
</p>

<p>
<code>pivot : ∀t. ∀i. t -&gt; list_{i} t -&gt; list_{i} t * list_{i} t</code>
</p>

<p>
mais la &ldquo;bonne&rdquo; approximation, qui permet de garantir la spécification de
<code>quicksort</code> serait:
</p>

<p>
<code>pivot : ∀t. ∀i,j. t -&gt; list_{i+j} t -&gt; list_{i} t * list_{j} t</code>,
</p>

<p>
mais on ne peut pas induire sur les sommes !
</p>
</div>
</div>

<div id="outline-container-org53aa91e" class="outline-4">
<h4 id="org53aa91e"><i>Embedded ML</i> : Hughes &amp; Pareto (1999)</h4>
<div class="outline-text-4" id="text-org53aa91e">
<p>
Extension de leurs système à un langage de programmation à la ML, avec
sémantique opérationelle à petit-pas basée sur la SECD, avec analyse des coûts
de pile et tas. On ajoute une primitive d&rsquo;allocation de mémoire <code>letregion ρ#e
in e</code> où <code>ρ#e</code> est une nouvelle région mémoire de capacité dynamique.
</p>

<p>
Ce n&rsquo;est hélas pas suffisant pour l&rsquo;espace mémoire d&rsquo;instant de système
synchrone, car la récursion peut créer des piles de régions. Le système est donc
augmenté d&rsquo;un <i>region resetting</i>. Aussi, on ne peut pas implémenter les
structures infinies commes les streams.
</p>
</div>
</div>

<div id="outline-container-org3966777" class="outline-4">
<h4 id="org3966777">Chin, Khoo (2001-2006)</h4>
<div class="outline-text-4" id="text-org3966777">
<p>
Chin&amp;Khoo ont un système avec inférence, basé sur l&rsquo;arithmétique de Presburger,
qui est décidable (en passant par Omega). Il gèrent la récurrence avec une
opération de <i>fermeture transitive des contraintes linéaires</i> permettant de
&ldquo;fermer la boucle&rdquo;: passer d&rsquo;une étape de récurrence au calcul complet.
</p>

<p>
<i>Exemple de résultat: <code>append</code></i>
</p>
<pre class="example">
append : list_{m} t -&gt; list_{n} t -&gt; list{l} t
avec:
  - m ≥ 0, n ≥ 0, l = m + n
  - m &gt; m' ≥ 0, n' = n
</pre>
<p>
<code>n'</code> et <code>m'</code> sont les tailles à l&rsquo;étape de récursion suivante. (comme une sorte
de post/pre)
</p>

<p>
On s&rsquo;intéresse à des propriétés de <i>sécurité</i>, pas de <i>liveliness</i> ou de
<i>productivité</i> comme chez Hughes &amp; Pareto. Chaque type possède sa propre notion
de taille: p.ex les booléens sont de taille 0 ou 1. On peut alors typer <code>null</code>
sur les listes de la manière suivante:
</p>

<pre class="example">
null : List_{n} a -&gt; bool_{c} s.t. (n = 0 ∧ c = 1) ∨ (n &gt; 0 ∧ c = 0)
</pre>

<p>
Ca ressemble à ce qu&rsquo;on peut faire avec des GADT, il faudra regarder ce lien de
plus près. On pourrait faire une équivalence entre les variables fantôme des
GADT (empty | nonempty) et des invariants de tailles (n = 0 | n &gt; 0). On ferra
attention à ne pas oublier qu&rsquo;on travaille à l&rsquo;ordre supérieur. La discipline de
typage de Chin &amp; Khoo n&rsquo;a pas de preuve valide pour les types d&rsquo;ordre
supérieurs. Leur preuve implique l&rsquo;existence de contraintes décrivant exactement
la taille d&rsquo;une valeur annoté d&rsquo;un certain type. Ces contraintes n&rsquo;existent pas
à l&rsquo;ordre supérieure.
</p>
</div>
</div>
</div>

<div id="outline-container-org45bd117" class="outline-3">
<h3 id="org45bd117">Types Dépendants</h3>
<div class="outline-text-3" id="text-org45bd117">
</div>
<div id="outline-container-org3c7bac9" class="outline-4">
<h4 id="org3c7bac9"><i>Dependent ML</i></h4>
<div class="outline-text-4" id="text-org3c7bac9">
<p>
Créé en 1999, <i>dependent ML</i> (DML) est une extension d&rsquo;OCaml avec types
dépendants, mais relativement conservative. On y maintient la décidabilité du
typage et on s&rsquo;y efforce de maintenir les annotations des types dépendants au
minimum. DML sépare les valeurs classique d&rsquo;OCaml des <i>indices</i> présents dans
les types, qui sont pris dans un domaine de contraintes décidables. On peut par
exemple utiliser des indices dans ℕ avec l&rsquo;arithmétique de Presburger, qui sont
ensuite résolus par Omega: l&rsquo;évaluation des indices est limitée à la
normalisation des contraintes.
</p>

<p>
Les types dépendants sont introduits par des raffinement de types afin de ne pas
avoir à changer le code non-dépendants. <code>{v:T} U</code> introduit le produit Π(v:T)U
et <code>[v:T | P]</code> introduit la somme Σ(v:T)P.
</p>

<pre class="example">
append &lt;| {m:nat}{n:nat} 'a list(m) * 'a list(n) -&gt; 'a list(m+n)
filter &lt;| ('a -&gt; bool) * {n:nat} 'a list(n) -&gt; [m:nat| m&lt;=n] 'a list(m)
</pre>


<dl class="org-dl">
<dt>Avantage</dt><dd>On peut définir nos propres notions de tailles, alors qu&rsquo;avec les
<i>Sized Types</i> la notion est rigide.</dd>
<dt>Inconvénient</dt><dd>On ne résout par le problème de l&rsquo;inférence, au contraire !
On est passé au problème de l&rsquo;inférence des types dépendants&#x2026;</dd>
</dl>

<p>
Grobauer a utilisé DML pour inférer des relations de récurrences sur les coûts
des calculs, mais ils faut encore les résoudre à la main.
</p>
</div>
</div>

<div id="outline-container-org36a01da" class="outline-4">
<h4 id="org36a01da">LXres (Crary &amp; Weirich)</h4>
<div class="outline-text-4" id="text-org36a01da">
<p>
<i>LXres</i> est un langage de programmation avec type dépendants et
code-comme-preuve permettant d&rsquo;exposer des &ldquo;horloges virtuelles&rdquo; au niveau des
types, et donc de mesurer les coûts liés à ces horloges. Ces estimations de
coûts sont des <i>fonctions primitives récursives</i>, un formalisme puissant pour le
problème en question. (En comparaison à, par exemple, l&rsquo;arithmétique de
Presburger).
</p>
</div>
</div>
