posts/vasconcelos2008.org
*** à la Epigram (Brady & Hammond)

Un langage dépendant avec un type =Size=: les valeurs =size v p : Size A P=
annotent les valeurs =v= indicés par une taille entière =n= et de type =A n=. La
preuve =p : P= témoigne alors d'une propriété de taille de =v=. On étend cette
technique aux fonctions d'ordre supérieur en associant des fonctions générant
les =Size= des arguments d'ordre supérieurs. Mais ces approximations de taille
pour les valeurs d'ordre supérieur ne sont pas inférées, et les obtenir
manuellement.

Aussi, le système infère des propriétés de taille, donc dénotationnelles, mais ne
considère pas l'obtention de propriétés intentionnelles. On ne peut pas
directement utiliser ces travaux pour obtenir des informations sur l'évaluation.

*** Cost Monad (Danielson)

#+BEGIN_SRC haskell
return :: a -> Thunk 0 a
bind :: Thunk n a -> (a -> Thunk m b) -> Thunk (n+m) b
tick :: Thunk n a -> Thunk (S n) a
#+END_SRC

Des monades avec un indice dépendant pour la taille, implémenté dans Agda. On
peut raisonner sur l'évaluation paresseuse en incluant directement les =Thunk=
dans des structures de données. Il faut par contre bien connaître Agda pour
obtenir des résultats : On est loin de l'analyse automatique de ressource. On
peut néanmoins étendre cette approche aux coût dans une machine virtuelle.
Encore une fois, par d'inférence.

** Analyse amortie

On passe tout le blabla usuel sur Tarjan. Merci à lui quand même. On note
l'existence de "Purely Functionnal Data Structures" de Okasaki, inspiré de sa
thèse de doctorat de 1996.

Hoffman & Jost ont présenté dans "Type-Based Amortised Heap-Space Analysis" une
méthode... d'analyse amortie d'estimation de l'usage du tas par des programmes
fonctionnels, induite par les types des valeurs allouées. On est dans le
contexte d'un langage fonctionnel du premier ordre, avec évaluation stricte. Le
langage libère explicitement la mémoire alloué dynamiquement par une indication
syntaxique sur les clauses =match=. [NDLR: ce n'est pas très restrictif en
pratique. Par exemple, GHC n'alloue que sur les =let= et ne libère que sur les
=case of=].

Dans cette analyse, les jugements et environnement des typages sont étendus par
des coefficients de poids dans le tas, et des potentiels. On n'infère pas des
tailles, mais la part de la consommation de tas des structures. Les estimations
de taille mémoire ne sont obtenus qu'avec les tailles inconnues des structures
en entrée et en sorties.

#+BEGIN_SRC
x : List(List(Bool, 1), 2), 3 ⊢ e : List(Bool, 4), 5
#+END_SRC
Signifie que =x= est une liste de liste de booléens, et que si =x= contient /n/
éléments de tailles /t_1,... t_n/, alors un tas de /3+2n+∑t_i/ suffit à évaluer
=e=, dont les /m/ éléments occuperont /4m+5/ cases du tas.

Cette analyse peut inférer les poids des types non-annotés. On peut donc la
qualifier d'automatique. Pour ce faire, elle associe au programme un système
d'équation linéaires dont les solutions sont les poids à inférer. On peut alors
utiliser un système de résolution linéaire efficace tierce pour obtenir les
annotations.

Limites: Les bornes de la taille du tas sont des expressions linéaires en la
tailles des entrées-sorties. Mais on peut quand même diviser pour régner en
découpant le potentiel. On manque aussi de polymorphisme pour l'analyse des
fonctions, qui prennent des poids fixes, qui doivent correspondre à tout leurs
site d'appels. Enfin, étendre l'analyse à la pile est non-trivial. Les bornes en
les tailles des structures sont linéaire, alors que l'occupation de la pile est
souvent sub-linéaire. Campbell, dans sa thèse de 2008, étend ce système à la
prise en compte de la /profondeur/ des structures considérées.
