stage/vasconcelos2008.html

<div id="outline-container-orgcf5f62f" class="outline-4">
<h4 id="orgcf5f62f">à la Epigram (Brady &amp; Hammond)</h4>
<div class="outline-text-4" id="text-orgcf5f62f">
<p>
Un langage dépendant avec un type <code>Size</code>: les valeurs <code>size v p : Size A P</code>
annotent les valeurs <code>v</code> indicés par une taille entière <code>n</code> et de type <code>A n</code>. La
preuve <code>p : P</code> témoigne alors d&rsquo;une propriété de taille de <code>v</code>. On étend cette
technique aux fonctions d&rsquo;ordre supérieur en associant des fonctions générant
les <code>Size</code> des arguments d&rsquo;ordre supérieurs. Mais ces approximations de taille
pour les valeurs d&rsquo;ordre supérieur ne sont pas inférées, et les obtenir
manuellement.
</p>

<p>
Aussi, le système infère des propriétés de taille, donc dénotationnelles, mais ne
considère pas l&rsquo;obtention de propriétés intentionnelles. On ne peut pas
directement utiliser ces travaux pour obtenir des informations sur l&rsquo;évaluation.
</p>
</div>
</div>

<div id="outline-container-org934e9ae" class="outline-4">
<h4 id="org934e9ae">Cost Monad (Danielson)</h4>
<div class="outline-text-4" id="text-org934e9ae">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #29838d;">return</span> <span style="color: #cb9aad;">::</span> a <span style="color: #cb9aad;">-&gt;</span> <span style="color: #9a7500;">Thunk</span> <span style="color: #97365b; font-weight: bold;">0</span> a
<span style="color: #29838d;">bind</span> <span style="color: #cb9aad;">::</span> <span style="color: #9a7500;">Thunk</span> n a <span style="color: #cb9aad;">-&gt;</span> (a <span style="color: #cb9aad;">-&gt;</span> <span style="color: #9a7500;">Thunk</span> m b) <span style="color: #cb9aad;">-&gt;</span> <span style="color: #9a7500;">Thunk</span> (n<span style="color: #cb9aad;">+</span>m) b
<span style="color: #29838d;">tick</span> <span style="color: #cb9aad;">::</span> <span style="color: #9a7500;">Thunk</span> n a <span style="color: #cb9aad;">-&gt;</span> <span style="color: #9a7500;">Thunk</span> (<span style="color: #9a7500;">S</span> n) a
</pre>
</div>

<p>
Des monades avec un indice dépendant pour la taille, implémenté dans Agda. On
peut raisonner sur l&rsquo;évaluation paresseuse en incluant directement les <code>Thunk</code>
dans des structures de données. Il faut par contre bien connaître Agda pour
obtenir des résultats : On est loin de l&rsquo;analyse automatique de ressource. On
peut néanmoins étendre cette approche aux coût dans une machine virtuelle.
Encore une fois, par d&rsquo;inférence.
</p>
</div>
</div>
</div>

<div id="outline-container-org5d13b66" class="outline-3">
<h3 id="org5d13b66">Analyse amortie</h3>
<div class="outline-text-3" id="text-org5d13b66">
<p>
On passe tout le blabla usuel sur Tarjan. Merci à lui quand même. On note
l&rsquo;existence de &ldquo;Purely Functionnal Data Structures&rdquo; de Okasaki, inspiré de sa
thèse de doctorat de 1996.
</p>

<p>
Hoffman &amp; Jost ont présenté dans &ldquo;Type-Based Amortised Heap-Space Analysis&rdquo; une
méthode&#x2026; d&rsquo;analyse amortie d&rsquo;estimation de l&rsquo;usage du tas par des programmes
fonctionnels, induite par les types des valeurs allouées. On est dans le
contexte d&rsquo;un langage fonctionnel du premier ordre, avec évaluation stricte. Le
langage libère explicitement la mémoire alloué dynamiquement par une indication
syntaxique sur les clauses <code>match</code>. [NDLR: ce n&rsquo;est pas très restrictif en
pratique. Par exemple, GHC n&rsquo;alloue que sur les <code>let</code> et ne libère que sur les
=case of=].
</p>

<p>
Dans cette analyse, les jugements et environnement des typages sont étendus par
des coefficients de poids dans le tas, et des potentiels. On n&rsquo;infère pas des
tailles, mais la part de la consommation de tas des structures. Les estimations
de taille mémoire ne sont obtenus qu&rsquo;avec les tailles inconnues des structures
en entrée et en sorties.
</p>

<pre class="example">
x : List(List(Bool, 1), 2), 3 ⊢ e : List(Bool, 4), 5
</pre>
<p>
Signifie que <code>x</code> est une liste de liste de booléens, et que si <code>x</code> contient <i>n</i>
éléments de tailles <i>t<sub>1</sub>,&#x2026; t<sub>n</sub></i>, alors un tas de <i>3+2n+∑t<sub>i</sub></i> suffit à évaluer
<code>e</code>, dont les <i>m</i> éléments occuperont <i>4m+5</i> cases du tas.
</p>

<p>
Cette analyse peut inférer les poids des types non-annotés. On peut donc la
qualifier d&rsquo;automatique. Pour ce faire, elle associe au programme un système
d&rsquo;équation linéaires dont les solutions sont les poids à inférer. On peut alors
utiliser un système de résolution linéaire efficace tierce pour obtenir les
annotations.
</p>

<p>
Limites: Les bornes de la taille du tas sont des expressions linéaires en la
tailles des entrées-sorties. Mais on peut quand même diviser pour régner en
découpant le potentiel. On manque aussi de polymorphisme pour l&rsquo;analyse des
fonctions, qui prennent des poids fixes, qui doivent correspondre à tout leurs
site d&rsquo;appels. Enfin, étendre l&rsquo;analyse à la pile est non-trivial. Les bornes en
les tailles des structures sont linéaire, alors que l&rsquo;occupation de la pile est
souvent sub-linéaire. Campbell, dans sa thèse de 2008, étend ce système à la
prise en compte de la <i>profondeur</i> des structures considérées.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
